# LoadDensity Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
AreaBasedLoadData..::..LoadDensity Property
AreaBasedLoadData Class See Also
---
The load density of the area based load.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public double LoadDensity { get; }
```

Visual Basic
---
```text
Public ReadOnly Property LoadDensity As Double
	Get
```

Visual C++
---
```text
public:
property double LoadDensity {
	double get ();
}
```

# See Also
AreaBasedLoadData Class
Autodesk.Revit.DB.Electrical Namespace